{"version":1,"metatypes":[{"name":"Characteristic","description":"A NonTemporalEntity that is dependent for its existence on one or more PhysicalEntities that serve as its bearer","old_id":"132"},{"name":"ConceptualBoundary","description":"A ConceptualBoundary is an immaterial entity that is of zero, one or two dimensions and does not include a spatial region as part.","old_id":"133"},{"name":"DataItem","description":"An information content entity that is intended to be a truthful statement about something (modulo, e.g., measurement precision or other systematic errors) and is constructed/acquired by a method which reliably tends to produce (approximately) truthful statements.","old_id":"134"},{"name":"DataSet","description":"A data item that is an aggregate of other data items of the same type that have something in common. Averages and distributions can be determined for data sets.","old_id":"135"},{"name":"DateTimeDescription","description":"Description of date and time structured with separate values for the various elements of a calendar-clock system","old_id":"136"},{"name":"DateTimeInterval","description":"DateTimeInterval enables compact representation of an interval corresponding to a single element in a date-time description (i.e. a specified year, month, week, day, hour, minute, second). The property hasDateTimeDescription describes the interval.","old_id":"137"},{"name":"Diagram","description":"A figure that expresses one or more propositions","old_id":"138"},{"name":"Disposition","description":"A inherent characteristic which is such that (1) if it ceases to exist, then \nits bearer is physically changed, and (2) its realization occurs when this bearer is in some \nspecial physical circumstances, and (3) this realization occurs in virtue of the bearers \nphysical make-up.","old_id":"139"},{"name":"Document","description":"A collection of information content entities intended to be understood together as a whole","old_id":"140"},{"name":"DurationDescription","description":"Description of temporal extent structured with separate values for the various elements of a calendar-clock system.","old_id":"141"},{"name":"Entity","description":"An entity is anything that exists or has existed or will exist. (BFO definition)","old_id":"142"},{"name":"Equipment","description":"An object that performs a function in a facility.","old_id":"143"},{"name":"Figure","description":"An information content entity consisting of a two dimensional arrangement of information content entities such that the arrangement itself is about something.","old_id":"144"},{"name":"Function","description":"A function is a disposition that exists in virtue of the bearers physical make-up and this physical \nmake-up is something the bearer possesses because it came into being, either through evolution (in \nthe case of natural biological entities) or through intentional design (in the case of artifacts), in order to realize processes of a certain sort.","old_id":"145"},{"name":"Geometry","description":"A geometry is the shape and relative arrangement of the parts of something.","old_id":"146"},{"name":"History","description":"A history is a process that is the sum of the totality of processes taking place in the spatiotemporal region occupied by a material entity or site, including processes on the surface of the entity or within the cavities to which it serves as host. (BFO definition)","old_id":"147"},{"name":"Identifier","description":"An identifier is an information content entity that is the outcome of a dubbing process and is used to refer to one instance of entity shared by a group of people to refer to that individual entity.","old_id":"148"},{"name":"Image","description":"An image is an affine projection to a two dimensional surface, of measurements of some quality of an entity or entities repeated at regular intervals across a spatial range, where the measurements are represented as color and luminosity on the projected on surface.","old_id":"149"},{"name":"ImmaterialEntity","description":"Immaterial entities are divided into two subgroups:boundaries and sites, which bound, or are demarcated in relation, to material entities, and which can thus change location, shape and size as their material hosts move or change shape or size.","old_id":"150"},{"name":"InformationContentEntity","description":"All information items that are derived from material entities (i.e. statements that reference material qualities and are factual claims about an entity) fall under the domain of information content entity.","old_id":"151"},{"name":"InformationEntity","description":"An information entity [BFO:generically dependent continuant] is a non-temporal entiy [BFO:continuant] that depends on one or more other entities. (BFO definition)","old_id":"152"},{"name":"InherentCharacteristic","description":"An inherent characteristic [BFO:realizable entity] is a characteristic [BFO:specifically dependent continuant] that inheres in some physical entity [BFO:independent continuant] which is not a spatial region and is of a type instances of which are realized in processes of a correlated type. (BFO definition)","old_id":"153"},{"name":"Instant","description":"A temporal instance with zero extent or duration.","old_id":"154"},{"name":"Instruction","description":"An information content entity whose concretizations indicate to their bearer how to realize som entity in a process.","old_id":"155"},{"name":"Instrumentation","description":"An object that captures a Measurement.","old_id":"156"},{"name":"Interval","description":"A temporal instance with an extent or duration.","old_id":"157"},{"name":"MaterialEntity","description":"A material entity is a physical entity that has some portion of matter as a part.","old_id":"158"},{"name":"Measurement","description":"A measurement is a Value with the following relationships: a double value, a TemporalInstance relationship, a capturing MaterialEntity, a Quality and finally a unit.","old_id":"159"},{"name":"NonTemporalEntity","description":"A non-temporal entity [BFO:continuant] is an entity that persists, endures, or continues to exist through time while maintaining its identity. (BFO definition)","old_id":"160"},{"name":"Object","description":"An object is a material entity that is of a type that serves as a unit in the structure of reality.","old_id":"161"},{"name":"ObjectAggregate","description":"An entity a is an object aggregate if and only if there is a mutually exhaustive and pairwise disjoint partition of a into objects","old_id":"162"},{"name":"ObjectPart","description":"An object part is a defined division within an entity.","old_id":"163"},{"name":"OneDimensionalConceptualBoundary","description":"A one-dimensional conceptual boundary is a continuous conceptual line whose location is defined in relation to some material entity.","old_id":"164"},{"name":"OneDimensionalSpatialRegion","description":"A one-dimensional spatial region is a line or aggregate of lines stretching from one point in space to another. (BFO definition)","old_id":"165"},{"name":"PhysicalEntity","description":"A physical entity [BFO:independent continuant] is a non-temporal entity [BFO:continuant] which is such that there is no entiy c and time t such that the physical entity depends on c at t. (BFO definition)","old_id":"166"},{"name":"Process","description":"A process is a temporal entity [BFO:occurrent] that has temporal proper parts for some time t, and depends on some material entity at t. (BFO definition)","old_id":"167"},{"name":"ProcessBoundary","description":"A process boundary is a temporal part of a process that has no proper temporal parts. (BFO definition)","old_id":"168"},{"name":"ProcessProfile","description":"Process profiles of can be represented by means of a graph in which \nmeasures of a certain quality are plotted against time.","old_id":"169"},{"name":"ProperInterval","description":"An interval with non-zero extent or duration, i.e. for which the value of the beginning and end are different","old_id":"170"},{"name":"Quality","description":"A quality is a charcteristic [BFO:specifically dependent continuant] that, in contrast to roles and dispositions, does not require any further process in order to be realized. (BFO definition)","old_id":"171"},{"name":"QuantifiableQuality","description":"A QuantifiableQuality describes the magnitude of a standardised quantity and used as a factor to express occurring quantities of that property.","old_id":"172"},{"name":"Relation","description":"A quality that exists between and requires at least two entities.","old_id":"173"},{"name":"Role","description":"A role is an inherent characteristic [BFO:realizable entity] that exists because there is some single bearer that is in some special physical, social, or institutional set of circumstances in which this bearer does not have to be and the role is not such that, if it ceases to exist, then the physical make-up of the bearer is thereby changed. (BFO definition)","old_id":"174"},{"name":"Site","description":"A three-dimensional immaterial entity that is (partially or wholly) bounded by a material entity or it is a three-dimensional immaterial part thereof.","old_id":"175"},{"name":"SpatialRegion","description":"A spatial region is an immaterial entity that is a continuant part of space R as defined relative to some frame R. (BFO definition])","old_id":"176"},{"name":"SpatiotemporalRegion","description":"A spatiotemporal region is an TemporalEntity that is part of spacetime.","old_id":"177"},{"name":"Statement","description":"A statement is a collection of text meant to capture a complete idea or thought.","old_id":"178"},{"name":"Status","description":"A Status is a DataItem related to a TimeInstance, string containing Value, and an MaterialEntity.","old_id":"179"},{"name":"Symbol","description":"An information content entity that represents an entity by condensing the information using a substition.","old_id":"180"},{"name":"Table","description":"A figure that contains a two-dimensional arrangement of texts repeated at regular intervals across a spatial range, such that the spatial relationships among the constituent texts expresses propositions","old_id":"181"},{"name":"Tank","description":"Tank","old_id":"182"},{"name":"TemporalDuration","description":"Time extent; duration of a time interval separate from its particular start position","old_id":"183"},{"name":"TemporalEntity","description":"A temporal entity [BFO:occurrent] is an entity that unfolds itself in time or it is the instantaneous boundary of such an entity (for example a beginning or an ending) or it is a temporal or spatiotemporal region which such an entity occupies. (BFO definition)","old_id":"184"},{"name":"TemporalInstance","description":"A TemporalInstance is a temporal entity that reprsents a discrete entity related to a time T that is related to other TemporalInstances.","old_id":"185"},{"name":"TemporalPostion","description":"A position on a time-line","old_id":"186"},{"name":"TemporalReferenceSystem","description":"A Temporal Reference System provides the rules and definitions to provide a consistent structure to time elements.","old_id":"187"},{"name":"TemporalUnit","description":"A standard duration, which provides the scale factor for a time extent, or the granularity or precision for a time position.","old_id":"188"},{"name":"Text","description":"Text is a part of a manifestation whose concretizations are patterns of glyphs intended to be interpreted as words, formulas, etc.","old_id":"189"},{"name":"ThreeDimensionalSpatialRegion","description":"A three-dimensional spatial region is a spatial region that is of three dimensions. (BFO definition)","old_id":"190"},{"name":"TimePosition","description":"A temporal position described using either a (nominal) value from an ordinal reference system, or a (numeric) value in a temporal coordinate system.","old_id":"191"},{"name":"TimeSeriesDataSet","description":"A data set that is an aggregate of data recording some measurement at a number of time points. The time series data set is an ordered list of pairs of time measurement data and the corresponding measurement data acquired at that time.","old_id":"192"},{"name":"TwoDimensionalConceptualBoundary","description":"a two-dimensional conceptual boundary (surface) is a self-connected fiat surface whose location is defined in relation to some material entity.","old_id":"193"},{"name":"TwoDimensionalSpatialRegion","description":"A two-dimensional spatial region is a spatial region that is of two dimensions. (BFO definition)","old_id":"194"},{"name":"Value","description":"A Value is a DataItem used to describe another entity.","old_id":"195"},{"name":"ZeroDimensionalConceptualBoundary","description":"Zero dimension conceptual boundaries are not spatial points. Considering the example &apos;the quadripoint where the boundaries of Colorado, Utah, New Mexico, and Arizona meet&apos; : There are many frames in which that point is zooming through many points in space. Whereas, no matter what the frame, the quadripoint is always in the same relation to the boundaries of Colorado, Utah, New Mexico, and Arizona.","old_id":"196"}],"metatype_keys":[],"relationships":[{"name":"containedIn","description":"an item is contained by a collection","old_id":"16"},{"name":"contains","description":"a collection that contains other items","old_id":"17"},{"name":"decomposedBy","description":"Identifies the children of some entity.","old_id":"18"},{"name":"decomposes","description":"Identifies the parent of this entity.","old_id":"19"},{"name":"relates","description":"A generic relationship to be used when other available relationships are insufficient. Can often be used for relationships between entities that have the same LML parent (e.g. artifact, asset).","old_id":"20"},{"name":"specifiedBy","description":"Denotes a relationship to some quality using the Characteristic naming convention from LML (specified by).","old_id":"21"},{"name":"specifies","description":"Denotes a relationship between a property and the object that bears it.","old_id":"22"}],"relationship_keys":[],"relationship_pairs":[],"data_sources":[{"DataSourceRecord":{"adapter_type":"timeseries","status":"ready","active":true,"archived":false,"config":{"kind":"timeseries","data_retention_days":30,"raw_retention_enabled":false,"fast_load_enabled":false,"columns":[{"is_primary_timestamp":true,"unique":false,"id":"caeb93d0-f92d-4eaa-8db8-62bd0ad8e17b","type":"date","column_name":"timestamp","property_name":"timestamp","date_conversion_format_string":"YYYY-MM-DD HH24:MI:SS.US"},{"is_primary_timestamp":false,"unique":false,"id":"9156fdf7-0430-455b-bca9-b8dcdcaa6335","type":"float","column_name":"seconds","property_name":"seconds"},{"is_primary_timestamp":false,"unique":false,"id":"f07e10c3-5914-40b2-86e0-91464857081d","type":"float","column_name":"tc_201","property_name":"tc_201"}],"attachment_parameters":[{"key":"","type":"data_source","value":"486","operator":"=="},{"key":"","type":"id","value":"7310045","operator":"=="}]},"id":"15","container_id":"4","name":"TC-201","data_format":null,"created_at":"2024-07-16T16:46:47.337Z","modified_at":"2024-07-16T16:46:48.556Z","created_by":"1","modified_by":"1","status_message":null}}]}